# StartOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Extrusion..::..StartOffset Property
Extrusion Class See Also
---
The offset of the start of the extrusion relative to the sketch plane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double StartOffset { get; set; }
```

Visual Basic
---
```text
Public Property StartOffset As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double StartOffset {
	double get ();
	void set (double value);
}
```

# Remarks
The direction of the offset is based on the normal of the extrusion's sketch plane: a positive value is in the direction of the normal, a negative value is in the other direction.
# See Also
Extrusion Class
Autodesk.Revit.DB Namespace